# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 2 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024]  # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768]   # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512]   # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512]   # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 1, RepNCSPELAN4_CAA, [128, 64, 32, 1]]
  - [-1, 1, V7DownSampling, [256]]  # 3-P3/8
  - [-1, 1, RepNCSPELAN4_CAA, [256, 128, 64, 1]]
  - [-1, 1, V7DownSampling, [512]]  # 5-P4/16
  - [-1, 6, CSP_PTB, [512, 0.25, True]]
  - [-1, 1, V7DownSampling, [1024]]  # 7-P5/32
  - [-1, 3, CSP_PTB, [1024, 0.5, True]]
  - [-1, 1, Conv, [256, 1]]  # 9
  - [-1, 1, AIFI, [1024, 8]] # 10

# DAMO-YOLO GFPN Head
head:
  - [-1, 1, Conv, [512, 1, 1]] # 11
  - [6, 1, Conv, [512, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 3, CSPStage, [512]] # 14

  - [-1, 1, DySample, [2, 'lp']] #15
  - [4, 1, Conv, [256, 3, 2]] # 16
  - [[15, -1, 6], 1, Concat, [1]]
  - [-1, 3, CSPStage, [512]] # 18

  - [-1, 1, DySample, [2, 'lp']] #19
  - [2, 1, Conv, [256, 3, 2]] # 20
  - [[19, -1, 4], 1, Concat, [1]]
  - [-1, 3, CSPStage, [512]] # 22

  - [ -1, 1, DySample, [ 2, 'lp' ] ]
  - [ [ -1, 2 ], 1, Concat, [ 1 ] ]
  - [ -1, 3, CSPStage, [128] ] # 25

  - [-1, 1, V7DownSampling, [128]]
  - [[-1, 22], 1, Concat, [1]]
  - [-1, 3, CSPStage, [256]] # 28

  - [-1, 1, V7DownSampling, [256]]
  - [[-1, 18], 1, Concat, [1]]
  - [-1, 3, CSPStage, [512]] # 31

  - [18, 1, Conv, [256, 3, 2]] # 32
  - [31, 1, Conv, [256, 3, 2]] # 33
  - [[14, 32, -1], 1, Concat, [1]]
  - [-1, 3, CSPStage, [1024]] # 35

  - [[25, 28, 31, 35], 1, Detect, [nc]] # Detect(P3, P4, P5)